### Imports

In [1]:
import os
import re
from pathlib import Path
import pandas as pd
import numpy as np
import altair as alt
from typing import Dict

### Load dataset

In [2]:


def load_csv(path: Path, **kwargs):
    df = pd.read_csv(path, **kwargs)
    print(f"Loaded {path}: {df.shape[0]} rows, {df.shape[1]} cols")
    return df
ROOT = Path().resolve()
DATA_DIR = ROOT / 'data'

dfs: Dict[str, pd.DataFrame] = {}

dfs['companies'] = load_csv(DATA_DIR / 'companies' / 'companies.csv')
dfs['company_industries'] = load_csv(DATA_DIR / 'companies' / 'company_industries.csv')
dfs['company_specialities'] = load_csv(DATA_DIR / 'companies' / 'company_specialities.csv')
dfs['employee_counts'] = load_csv(DATA_DIR / 'companies' / 'employee_counts.csv')

dfs['benefits'] = load_csv(DATA_DIR / 'jobs' / 'benefits.csv')
dfs['job_industries'] = load_csv(DATA_DIR / 'jobs' / 'job_industries.csv')
dfs['job_skills'] = load_csv(DATA_DIR / 'jobs' / 'job_skills.csv')
dfs['salaries'] = load_csv(DATA_DIR / 'jobs' / 'salaries.csv')

dfs['industries'] = load_csv(DATA_DIR / 'mappings' / 'industries.csv')
dfs['skills'] = load_csv(DATA_DIR / 'mappings' / 'skills.csv')

dfs['postings'] = load_csv(DATA_DIR / 'postings.csv', low_memory=False)

Loaded /Users/richa/Desktop/cs424/assignment2/data/companies/companies.csv: 24473 rows, 10 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/companies/company_industries.csv: 24375 rows, 2 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/companies/company_specialities.csv: 169387 rows, 2 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/companies/employee_counts.csv: 35787 rows, 4 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/jobs/benefits.csv: 67943 rows, 3 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/jobs/job_industries.csv: 164808 rows, 2 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/jobs/job_skills.csv: 213768 rows, 2 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/jobs/salaries.csv: 40785 rows, 8 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/mappings/industries.csv: 422 rows, 2 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/mappings/skills.csv: 35 rows, 2 cols
Loaded /Users/richa/Desktop/cs424/assignment2/data/postings.csv: 123849 rows, 31 cols

In [3]:

for k in ['companies', 'postings', 'salaries', 'job_skills', 
          'benefits', 'employee_counts', 'industries', 'skills',
          'company_industries', 'company_specialities', 'job_industries']:
    print(f"Preview of {k} — {dfs[k].shape[0]} rows × {dfs[k].shape[1]} cols")
    display(dfs[k].head(5))

Preview of companies — 24473 rows × 10 cols

,company_id,name,description,company_size,state,country,city,zip_code,address,url
0,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm
1,1016,GE HealthCare,Every day millions of people feel the impact o...,7.0,0,US,Chicago,0,-,https://www.linkedin.com/company/gehealthcare
2,1025,Hewlett Packard Enterprise,Official LinkedIn of Hewlett Packard Enterpris...,7.0,Texas,US,Houston,77389,1701 E Mossy Oaks Rd Spring,https://www.linkedin.com/company/hewlett-packa...
3,1028,Oracle,We’re a cloud technology company that provides...,7.0,Texas,US,Austin,78741,2300 Oracle Way,https://www.linkedin.com/company/oracle
4,1033,Accenture,Accenture is a leading global professional ser...,7.0,0,IE,Dublin 2,0,Grand Canal Harbour,https://www.linkedin.com/company/accenture

Preview of postings — 123849 rows × 31 cols

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,...,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type,normalized_salary,zip_code,fips
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,Requirements: \n\nWe are seeking a College or ...,1.713398e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,38480.0,8540.0,34021.0
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,NaN,1.712858e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,83200.0,80521.0,8069.0
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,We are currently accepting resumes for FOH - A...,1.713278e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,55000.0,45202.0,39061.0
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,NaN,...,This position requires a baseline understandin...,1.712896e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,157500.0,11040.0,36059.0
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.0,YEARLY,"Burlington, IA",NaN,3.0,NaN,...,NaN,1.713452e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,70000.0,52601.0,19057.0

Preview of salaries — 40785 rows × 8 cols

,salary_id,job_id,max_salary,med_salary,min_salary,pay_period,currency,compensation_type
0,1,3884428798,NaN,20.0,NaN,HOURLY,USD,BASE_SALARY
1,2,3887470552,25.0,NaN,23.0,HOURLY,USD,BASE_SALARY
2,3,3884431523,120000.0,NaN,100000.0,YEARLY,USD,BASE_SALARY
3,4,3884911725,200000.0,NaN,10000.0,YEARLY,USD,BASE_SALARY
4,5,3887473220,35.0,NaN,33.0,HOURLY,USD,BASE_SALARY

Preview of job_skills — 213768 rows × 2 cols

       job_id skill_abr
0  3884428798      MRKT
1  3884428798        PR
2  3884428798       WRT
3  3887473071      SALE
4  3887465684       FIN

Preview of benefits — 67943 rows × 3 cols

       job_id  inferred                     type
0  3887473071         0        Medical insurance
1  3887473071         0         Vision insurance
2  3887473071         0         Dental insurance
3  3887473071         0                   401(k)
4  3887473071         0  Student loan assistance

Preview of employee_counts — 35787 rows × 4 cols

   company_id  employee_count  follower_count  time_recorded
0      391906             186           32508     1712346173
1    22292832             311            4471     1712346173
2       20300            1053            6554     1712346173
3     3570660             383           35241     1712346173
4      878353              52           26397     1712346173

Preview of industries — 422 rows × 2 cols

   industry_id                         industry_name
0            1       Defense and Space Manufacturing
1            3       Computer Hardware Manufacturing
2            4                  Software Development
3            5          Computer Networking Products
4            6  Technology, Information and Internet

Preview of skills — 35 rows × 2 cols

  skill_abr          skill_name
0       ART        Art/Creative
1      DSGN              Design
2      ADVR         Advertising
3      PRDM  Product Management
4      DIST        Distribution

Preview of company_industries — 24375 rows × 2 cols

   company_id                        industry
0      391906  Book and Periodical Publishing
1    22292832                    Construction
2       20300                         Banking
3     3570660  Book and Periodical Publishing
4      878353         Staffing and Recruiting

Preview of company_specialities — 169387 rows × 2 cols

   company_id              speciality
0    22292832      window replacement
1    22292832  patio door replacement
2       20300      Commercial Banking
3       20300          Retail Banking
4       20300                Mortgage

Preview of job_industries — 164808 rows × 2 cols

       job_id  industry_id
0  3884428798           82
1  3887473071           48
2  3887465684           41
3  3887467939           82
4  3887467939           80

### Schema overview & missing values profile

In [4]:
def profile(df: pd.DataFrame, name: str):
    if df is None: return None
    info = pd.DataFrame({
        'column': df.columns,
        'dtype': [df[c].dtype for c in df.columns],
        'non_null': [df[c].notna().sum() for c in df.columns],
        'nulls': [df[c].isna().sum() for c in df.columns],
        'null_pct': [round(100*df[c].isna().mean(),2) for c in df.columns],
        'nunique': [df[c].nunique(dropna=True) for c in df.columns],
    })
    info['table'] = name
    return info

profiles = []
for name, df in dfs.items():
    p = profile(df, name)
    if p is not None:
        profiles.append(p)
schema_profile = pd.concat(profiles, ignore_index=True)
schema_profile.sort_values(['table','column'])

        column    dtype  non_null  nulls  null_pct  nunique      table
19    inferred    int64     67943      0      0.00        2   benefits
18      job_id    int64     67943      0      0.00    30023   benefits
20        type   object     67943      0      0.00       12   benefits
8      address   object     24451     22      0.09    19476  companies
6         city   object     24472      1      0.00     4124  companies
..         ...      ...       ...    ...       ...      ...        ...
29  min_salary  float64     33947   6838     16.77     4620   salaries
30  pay_period   object     40785      0      0.00        5   salaries
25   salary_id    int64     40785      0      0.00    40785   salaries
35   skill_abr   object        35      0      0.00       35     skills
36  skill_name   object        35      0      0.00       35     skills

[68 rows x 7 columns]

## Dataset Cleaning 

This module provides a structured data-cleaning pipeline for the
*Data Science Job Postings 2025* dataset.

**Functionality:**

- **State Extraction:** Uses regular expressions to extract U.S. state abbreviations from the `headquarter` column and maps them to FIPS codes (`state`, `fips`, `fips_int` columns).
- **Salary Parsing:** Converts salary text ranges (e.g., "$80K–$120K") into numeric midpoints via normalization and numeric extraction (`salary_mid`).
- **Seniority Normalization:** Cleans and standardizes the `seniority_level` column to lowercase values, replacing invalid entries.
- **Skills Parsing:** Transforms stringified skill lists into clean Python lists (`skills_list`) by stripping brackets, quotes, and whitespace.
- **Deduplication:** Removes duplicate job postings using key columns (`job_title`, `company`, `location`, `post_date`, `salary`, `skills`).

In [7]:
from __future__ import annotations
import re
import pandas as pd

# --- Constants ---
STATE_ABBR = r"\b(AL|AK|AZ|AR|CA|CO|CT|DE|FL|GA|HI|ID|IL|IN|IA|KS|KY|LA|ME|MD|MA|MI|MN|MS|MO|MT|NE|NV|NH|NJ|NM|NY|NC|ND|OH|OK|OR|PA|RI|SC|SD|TN|TX|UT|VT|VA|WA|WV|WI|WY|DC)\b"
_ABBR_TO_FIPS = {
    'AL':'01','AK':'02','AZ':'04','AR':'05','CA':'06','CO':'08','CT':'09','DE':'10','DC':'11','FL':'12','GA':'13',
    'HI':'15','ID':'16','IL':'17','IN':'18','IA':'19','KS':'20','KY':'21','LA':'22','ME':'23','MD':'24','MA':'25',
    'MI':'26','MN':'27','MS':'28','MO':'29','MT':'30','NE':'31','NV':'32','NH':'33','NJ':'34','NM':'35','NY':'36',
    'NC':'37','ND':'38','OH':'39','OK':'40','OR':'41','PA':'42','RI':'44','SC':'45','SD':'46','TN':'47','TX':'48',
    'UT':'49','VT':'50','VA':'51','WA':'53','WV':'54','WI':'55','WY':'56'
}

_state_pat = re.compile(STATE_ABBR)


def extract_state(headquarter: pd.Series) -> pd.Series:
    def _one(x):
        s = str(x).upper()
        m = _state_pat.search(s)
        return m.group(1) if m else None
    return headquarter.astype(str).map(_one)


# Salary midpoint parser
def parse_salary(s):
    s = str(s)
    if not s or s.lower() in {"nan", "none"}:
        return None
    s_norm = s.replace("–", "-").lower()  # normalize en dash, lowercase for 'k'
    nums = [float(x.replace(",", "")) for x in re.findall(r"\d[\d,]*\.?\d*", s_norm)]
    if not nums:
        return None
    mid = (nums[0] + nums[1]) / 2 if len(nums) >= 2 else nums[0]
    if "k" in s_norm:
        mid *= 1000.0
    return mid


# skills parser
def parse_skills(s):
    """Parse a simple list-like string into a Python list of skills."""
    if not isinstance(s, str) or not s.strip():
        return []
    return [x.strip(" '\"") for x in s.strip("[]").split(",") if x.strip()]


def clean_jobs_df(df_raw: pd.DataFrame) -> pd.DataFrame:
    df = df_raw.copy()

    # State + FIPS
    df["state"] = extract_state(df.get("headquarter"))
    df["fips"] = df["state"].map(_ABBR_TO_FIPS)  # zero-padded string, e.g., '06'
    df["fips_int"] = pd.to_numeric(df["fips"], errors="coerce").astype("Int64")  # nullable integer

    # Salary
    df["salary_mid"] = df.get("salary", pd.Series([None]*len(df))).apply(parse_salary)

    # Seniority normalization
    df["seniority_level_norm"] = (
        df.get("seniority_level", pd.Series([None]*len(df)))
          .astype(str).str.lower().str.strip().replace({"nan": pd.NA, "": pd.NA})
    )

    # Skills list
    df["skills_list"] = df.get("skills", pd.Series([None]*len(df))).apply(parse_skills)

    # De-duplication
    dedup_keys = ["job_title", "company", "location", "post_date", "salary", "skills"]
    existing_keys = [c for c in dedup_keys if c in df.columns]
    if existing_keys:
        df = df.drop_duplicates(subset=existing_keys)
    return df


if __name__ == "__main__":
    in_path = DATA_DIR /"data_science_job_posts_2025.csv"
    out_path = DATA_DIR /"data_science_job_posts_2025_clean.csv"
    raw = pd.read_csv(in_path, low_memory=False)
    clean = clean_jobs_df(raw)
    clean.to_csv(out_path, index=False)
    print(f"Completed cleaning. new cleaned Dataset created at → {out_path}\n")

Completed cleaning. new cleaned Dataset created at → /Users/richa/Desktop/cs424/assignment2/data/data_science_job_posts_2025_clean.csv

## 2. Quick summaries, profiling, and cleaning
Below are added code cells that:
- compute column-level profiles (dtypes, non-null counts, null percentages, unique counts)
- show basic numeric summaries and unique value counts for categorical columns
- visualize distributions with Altair (Vega-Lite)
- handle missing values (drop or simple imputation)
- save a cleaned subset for downstream work

In [8]:
# Numeric and categorical summaries
from IPython.display import display, Markdown
def summarize_df(df, name='df', max_unique_cat=30):
    display(Markdown(f'### Summary for `{name}` — {df.shape[0]} rows × {df.shape[1]} cols'))
    display(df.describe(include='all').transpose())
    # separate numeric and categorical
    num_cols = df.select_dtypes(include=['number']).columns.tolist()
    cat_cols = df.select_dtypes(include=['object','category','bool']).columns.tolist()
    display(Markdown(f'**Numeric columns ({len(num_cols)}):** {num_cols}'))
    display(Markdown(f'**Categorical columns ({len(cat_cols)}):** {cat_cols}'))
    # show unique counts for categorical columns (but only up to max_unique_cat unique values)
    for c in cat_cols:
        nunique = df[c].nunique(dropna=True)
        if nunique <= max_unique_cat:
            display(Markdown(f'`{c}` — {nunique} unique: ' + ', '.join(map(str, df[c].dropna().unique()[:max_unique_cat]))))
        else:
            display(Markdown(f'`{c}` — {nunique} unique'))

# run summary for main tables you likely care about
for k in ['postings','companies','salaries']:
    if k in dfs:
        summarize_df(dfs[k], k)

### Summary for `postings` — 123849 rows × 31 cols

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
job_id,123849.0,NaN,NaN,NaN,3896402138.074615,84043545.161881,921716.0,3894586595.0,3901998406.0,3904707077.0,3906267224.0
company_name,122130,24428,Liberty Healthcare and Rehabilitation Services,1108,NaN,NaN,NaN,NaN,NaN,NaN,NaN
title,123849,72521,Sales Manager,673,NaN,NaN,NaN,NaN,NaN,NaN,NaN
description,123842,107827,Position Summary: Our Sales Manager has managi...,474,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max_salary,29793.0,NaN,NaN,NaN,91939.423461,701110.138622,1.0,48.28,80000.0,140000.0,120000000.0
pay_period,36073,5,YEARLY,20628,NaN,NaN,NaN,NaN,NaN,NaN,NaN
location,123849,8526,United States,8125,NaN,NaN,NaN,NaN,NaN,NaN,NaN
company_id,122132.0,NaN,NaN,NaN,12204012.335015,25541431.65742,1009.0,14352.0,226965.0,8047188.0,103472979.0
views,122160.0,NaN,NaN,NaN,14.618247,85.903598,1.0,3.0,4.0,8.0,9975.0
med_salary,6280.0,NaN,NaN,NaN,22015.619876,52255.873846,0.0,18.94,25.5,2510.5,750000.0
min_salary,29793.0,NaN,NaN,NaN,64910.847434,495973.793504,1.0,37.0,60000.0,100000.0,85000000.0
formatted_work_type,123849,7,Full-time,98814,NaN,NaN,NaN,NaN,NaN,NaN,NaN
applies,23320.0,NaN,NaN,NaN,10.591981,29.047395,1.0,1.0,3.0,8.0,967.0
original_listed_time,123849.0,NaN,NaN,NaN,1713152338799.941895,484820878.414758,1701810533000.0,1712862876000.0,1713395039000.0,1713478324000.0,1713572803000.0
remote_allowed,15246.0,NaN,NaN,NaN,1.0,0.0,1.0,1.0,1.0,1.0,1.0
job_posting_url,123849,123849,https://www.linkedin.com/jobs/view/921716/?trk...,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
application_url,87184,84800,https://app.dataannotation.tech/worker_signup?...,205,NaN,NaN,NaN,NaN,NaN,NaN,NaN
application_type,123849,4,OffsiteApply,84607,NaN,NaN,NaN,NaN,NaN,NaN,NaN
expiry,123849.0,NaN,NaN,NaN,1716213036608.151855,2321393898.084216,1712903448000.0,1715480718000.0,1716042264000.0,1716088229000.0,1729124796000.0
closed_time,1073.0,NaN,NaN,NaN,1712927892086.672852,362289347.409251,1712345932000.0,1712669760000.0,1712669910000.0,1713282569000.0,1713562107000.0
formatted_experience_level,94440,6,Mid-Senior level,41489,NaN,NaN,NaN,NaN,NaN,NaN,NaN
skills_desc,2439,2212,This position requires the following skills: E...,28,NaN,NaN,NaN,NaN,NaN,NaN,NaN
listed_time,123849.0,NaN,NaN,NaN,1713204445996.681396,398912198.59405,1711317014000.0,1712885544000.0,1713407593000.0,1713483628000.0,1713572816000.0
posting_domain,83881,4443,www.click2apply.net,3811,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sponsored,123849.0,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0
work_type,123849,7,FULL_TIME,98814,NaN,NaN,NaN,NaN,NaN,NaN,NaN
currency,36073,6,USD,36058,NaN,NaN,NaN,NaN,NaN,NaN,NaN
compensation_type,36073,1,BASE_SALARY,36073,NaN,NaN,NaN,NaN,NaN,NaN,NaN
normalized_salary,36073.0,NaN,NaN,NaN,205327.03685,5097626.762136,0.0,52000.0,81500.0,125000.0,535600000.0
zip_code,102977.0,NaN,NaN,NaN,50400.491887,30252.232515,1001.0,24112.0,48059.0,78201.0,99901.0
fips,96434.0,NaN,NaN,NaN,28713.879887,16015.929825,1003.0,13121.0,29183.0,42077.0,56045.0

**Numeric columns (16):** ['job_id', 'max_salary', 'company_id', 'views', 'med_salary', 'min_salary', 'applies', 'original_listed_time', 'remote_allowed', 'expiry', 'closed_time', 'listed_time', 'sponsored', 'normalized_salary', 'zip_code', 'fips']

**Categorical columns (15):** ['company_name', 'title', 'description', 'pay_period', 'location', 'formatted_work_type', 'job_posting_url', 'application_url', 'application_type', 'formatted_experience_level', 'skills_desc', 'posting_domain', 'work_type', 'currency', 'compensation_type']

`company_name` — 24428 unique

`title` — 72521 unique

`description` — 107827 unique

`pay_period` — 5 unique: HOURLY, YEARLY, MONTHLY, WEEKLY, BIWEEKLY

`location` — 8526 unique

`formatted_work_type` — 7 unique: Full-time, Internship, Contract, Part-time, Temporary, Volunteer, Other

`job_posting_url` — 123849 unique

`application_url` — 84800 unique

`application_type` — 4 unique: ComplexOnsiteApply, SimpleOnsiteApply, OffsiteApply, UnknownApply

`formatted_experience_level` — 6 unique: Entry level, Mid-Senior level, Associate, Director, Internship, Executive

`skills_desc` — 2212 unique

`posting_domain` — 4443 unique

`work_type` — 7 unique: FULL_TIME, INTERNSHIP, CONTRACT, PART_TIME, TEMPORARY, VOLUNTEER, OTHER

`currency` — 6 unique: USD, CAD, BBD, EUR, AUD, GBP

`compensation_type` — 1 unique: BASE_SALARY

### Summary for `companies` — 24473 rows × 10 cols

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
company_id,24473.0,NaN,NaN,NaN,20522391.62191,31659289.154874,1009.0,165404.0,2738154.0,26241420.0,103472979.0
name,24472,24428,Confidential,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
description,24176,24164,Our Purpose:\nWe help people love the way they...,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
company_size,21699.0,NaN,NaN,NaN,3.349233,1.904503,1.0,2.0,3.0,5.0,7.0
state,24451,788,0,2175,NaN,NaN,NaN,NaN,NaN,NaN,NaN
country,24473,81,US,21635,NaN,NaN,NaN,NaN,NaN,NaN,NaN
city,24472,4124,New York,1185,NaN,NaN,NaN,NaN,NaN,NaN,NaN
zip_code,24445,7779,0,3060,NaN,NaN,NaN,NaN,NaN,NaN,NaN
address,24451,19476,0,3972,NaN,NaN,NaN,NaN,NaN,NaN,NaN
url,24473,24473,https://www.linkedin.com/company/ibm,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Numeric columns (2):** ['company_id', 'company_size']

**Categorical columns (8):** ['name', 'description', 'state', 'country', 'city', 'zip_code', 'address', 'url']

`name` — 24428 unique

`description` — 24164 unique

`state` — 788 unique

`country` — 81 unique

`city` — 4124 unique

`zip_code` — 7779 unique

`address` — 19476 unique

`url` — 24473 unique

### Summary for `salaries` — 40785 rows × 8 cols

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
salary_id,40785.0,NaN,NaN,NaN,20393.0,11773.759701,1.0,10197.0,20393.0,30589.0,40785.0
job_id,40785.0,NaN,NaN,NaN,3895563848.870663,94966717.997285,921716.0,3894608085.0,3901980104.0,3904576109.0,3906267224.0
max_salary,33947.0,NaN,NaN,NaN,96209.871834,658737.342698,1.0,50.0,85000.0,142500.0,120000000.0
med_salary,6838.0,NaN,NaN,NaN,21370.298197,51338.564166,0.0,18.5,25.0,2207.0,750000.0
min_salary,33947.0,NaN,NaN,NaN,65085.406279,465061.235853,1.0,39.0,62300.0,100000.0,85000000.0
pay_period,40785,5,YEARLY,23768,NaN,NaN,NaN,NaN,NaN,NaN,NaN
currency,40785,6,USD,40770,NaN,NaN,NaN,NaN,NaN,NaN,NaN
compensation_type,40785,1,BASE_SALARY,40785,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Numeric columns (5):** ['salary_id', 'job_id', 'max_salary', 'med_salary', 'min_salary']

**Categorical columns (3):** ['pay_period', 'currency', 'compensation_type']

`pay_period` — 5 unique: HOURLY, YEARLY, MONTHLY, WEEKLY, BIWEEKLY

`currency` — 6 unique: USD, CAD, BBD, EUR, AUD, GBP

`compensation_type` — 1 unique: BASE_SALARY

In [10]:
# Cleaning: inspect missingness and apply simple strategies
from IPython.display import display, Markdown
def missing_report(df, name='df', show_top=10):
    display(Markdown(f'### Missingness report for `{name}`'))
    miss = pd.DataFrame({
        'column': df.columns,
        'dtype': [df[c].dtype for c in df.columns],
        'non_null': [df[c].notna().sum() for c in df.columns],
        'nulls': [df[c].isna().sum() for c in df.columns],
        'null_pct': [100*df[c].isna().mean() for c in df.columns],
        'nunique': [df[c].nunique(dropna=True) for c in df.columns],
    }).sort_values('null_pct', ascending=False)
    display(miss.head(show_top))
    return miss

# Example: run on postings
if 'postings' in dfs:
    miss_post = missing_report(dfs['postings'], 'postings', show_top=30)

    # strategy: drop columns with >90% missing, drop rows with critical missing data (e.g., job_id)
    cols_to_drop = miss_post[miss_post['null_pct']>90]['column'].tolist()
    print('Columns to drop (>90% missing):', cols_to_drop)
    cleaned = dfs['postings'].copy().drop(columns=cols_to_drop)
    # drop rows without job_id or title
    critical = [c for c in ['job_id','title','company_name'] if c in cleaned.columns]
    cleaned = cleaned.dropna(subset=critical, how='any')
    print('After dropping, shape:', cleaned.shape)
    # simple imputation example: fill missing numeric with median, categorical with 'Unknown'
    for c in cleaned.select_dtypes(include=['number']).columns:
        med = cleaned[c].median()
        cleaned[c] = cleaned[c].fillna(med)
    for c in cleaned.select_dtypes(include=['object','category']).columns:
        cleaned[c] = cleaned[c].fillna('Unknown')
    # save a sampled subset for faster future work
    sample = cleaned.sample(min(20000, len(cleaned)), random_state=42)
    sample.to_csv('postings_clean_sample.csv', index=False)
    print('Saved sample to postings_clean_sample.csv')
else:
    print('No postings table present; skipping cleaning step.')

### Missingness report for `postings`

                        column    dtype  non_null   nulls   null_pct  nunique
19                 closed_time  float64      1073  122776  99.133622      698
21                 skills_desc   object      2439  121410  98.030666     2212
9                   med_salary  float64      6280  117569  94.929309     1417
14              remote_allowed  float64     15246  108603  87.689848        1
12                     applies  float64     23320  100529  81.170619      274
4                   max_salary  float64     29793   94056  75.944093     5321
10                  min_salary  float64     29793   94056  75.944093     4612
26                    currency   object     36073   87776  70.873402        6
27           compensation_type   object     36073   87776  70.873402        1
28           normalized_salary  float64     36073   87776  70.873402     7266
5                   pay_period   object     36073   87776  70.873402        5
23              posting_domain   object     83881   39968  32.271556     4443
16             application_url   object     87184   36665  29.604599    84800
20  formatted_experience_level   object     94440   29409  23.745852        6
30                        fips  float64     96434   27415  22.135827     2270
29                    zip_code  float64    102977   20872  16.852780     6989
1                 company_name   object    122130    1719   1.387981    24428
7                   company_id  float64    122132    1717   1.386366    24474
8                        views  float64    122160    1689   1.363757      684
3                  description   object    123842       7   0.005652   107827
25                   work_type   object    123849       0   0.000000        7
24                   sponsored    int64    123849       0   0.000000        1
0                       job_id    int64    123849       0   0.000000   123849
22                 listed_time  float64    123849       0   0.000000    53231
18                      expiry  float64    123849       0   0.000000    54851
17            application_type   object    123849       0   0.000000        4
13        original_listed_time  float64    123849       0   0.000000    65036
11         formatted_work_type   object    123849       0   0.000000        7
6                     location   object    123849       0   0.000000     8526
2                        title   object    123849       0   0.000000    72521

Columns to drop (>90% missing): ['closed_time', 'skills_desc', 'med_salary']
After dropping, shape: (122130, 28)
Saved sample to postings_clean_sample.csv